app/Controllers/BarangMasuk.php

    public function index()
    {
        $data = [
            'title' => 'Data Barang Masuk',
            'barangmasuk' => $this->barangMasukModel->findAll()
---
SELECT *
FROM `barang_masuk`

    public function store()
    {
        $db = \Config\Database::connect();
        $db->transStart();

        try {
            // Simpan header barang masuk
            $dataHeader = [
                'no_faktur' => $this->request->getPost('no_faktur'),
                'tanggal' => $this->request->getPost('tanggal'),
                'supplier' => $this->request->getPost('supplier'),
                'total_harga' => str_replace(',', '', $this->request->getPost('total_harga')),
                'keterangan' => $this->request->getPost('keterangan')
            ];

            // Debug
            // var_dump($dataHeader);

            // Insert ke tabel barang_masuk
            $builder = $db->table('barang_masuk');
            $builder->insert($dataHeader);
---
INSERT INTO `barang_masuk` (`no_faktur`, `tanggal`, `supplier`, `total_harga`, `keterangan`) VALUES ('BM202412230003', '2024-12-23', 'TES', '1420000', 'TES')

                    // var_dump($dataDetail);

                    // Insert ke tabel barang_masuk_detail
                    $db->table('barang_masuk_detail')->insert($dataDetail);

                    // Update stok produk
                    $queryStok = $db->table('produk')->where('id_produk', $value)->get();
---
INSERT INTO `barang_masuk_detail` (`id_barang_masuk`, `id_produk`, `jumlah`, `harga`, `subtotal`) VALUES (5, 'P001', '20', '71000', '1420000')
SELECT *
FROM `produk`
WHERE `id_produk` = 'P001'


                    if ($produk) {
                        $stokBaru = $produk->stok + (int)$jumlah[$key];
                        $db->table('produk')
                            ->where('id_produk', $value)
                            ->update(['stok' => $stokBaru]);
---
UPDATE `produk` SET `stok` = 130
WHERE `id_produk` = 'P001'