app/Controllers/BarangKeluar.php

    public function store()
    {
        $db = \Config\Database::connect();
        $db->transStart();

        try {
            // Simpan header barang keluar
            $dataHeader = [
                'no_faktur' => $this->request->getPost('no_faktur'),
                'tanggal' => $this->request->getPost('tanggal'),
                'id_pelanggan' => $this->request->getPost('id_pelanggan'),
                'total_harga' => str_replace(',', '', $this->request->getPost('total_harga')),
                'keterangan' => $this->request->getPost('keterangan')
            ];

            // Insert ke tabel barang_keluar
            $builder = $db->table('barang_keluar');
            $builder->insert($dataHeader);
---
INSERT INTO `barang_keluar` (`no_faktur`, `tanggal`, `id_pelanggan`, `total_harga`, `keterangan`) VALUES ('BK202412230002', '2024-12-23', 'P-001', '142000', 'TES')

            foreach ($id_produk as $key => $value) {
                if ($value && $jumlah[$key]) {
                    // Cek stok terlebih dahulu
                    $queryStok = $db->table('produk')->where('id_produk', $value)->get();
---
SELECT *
FROM `produk`
WHERE `id_produk` = 'P001'

                            'harga' => str_replace(',', '', $harga[$key]),
                            'subtotal' => str_replace(',', '', $subtotal[$key])
                        ];
                        $db->table('barang_keluar_detail')->insert($dataDetail);

                        // Update stok produk
                        $db->table('produk')
                            ->where('id_produk', $value)
                            ->update(['stok' => $stokBaru]);
---
INSERT INTO `barang_keluar_detail` (`id_barang_keluar`, `id_produk`, `jumlah`, `harga`, `subtotal`) VALUES (8, 'P001', '2', '71000', '142000')
UPDATE `produk` SET `stok` = 128
WHERE `id_produk` = 'P001'