app/Controllers/Pelanggan.php

SELECT COUNT(*) AS `numrows`
FROM `pelanggan`
---
    public function datatables()
    {
        if ($this->request->isAJAX()) {
            $db = \Config\Database::connect();
            $builder = $db->table('pelanggan');

            // Pencarian
            $search = $this->request->getPost('search');
            if (isset($search['value'])) {
                $searchValue = $search['value'];
                $builder->groupStart()
                    ->like('nama_pelanggan', $searchValue)
                    ->orLike('alamat', $searchValue)
                    ->orLike('no_telfon', $searchValue)
                    ->groupEnd();
            }

            // Total records sebelum filter
            $totalRecords = $builder->countAllResults(false);