app/Models/BarangKeluarDetailModel.php

    public function getDetailWithProduk($id_barang_keluar)
    {
        $builder = $this->db->table($this->table);
        $builder->select('barang_keluar_detail.*, produk.nama_produk');
        $builder->join('produk', 'produk.id_produk = barang_keluar_detail.id_produk');
        $builder->where('id_barang_keluar', $id_barang_keluar);
        return $builder->get()->getResultArray();
---
SELECT `barang_keluar_detail`.*, `produk`.`nama_produk`
FROM `barang_keluar_detail`
JOIN `produk` ON `produk`.`id_produk` = `barang_keluar_detail`.`id_produk`
WHERE `id_barang_keluar` = '7'