app/Models/BarangKeluarModel.php

SELECT *
FROM `barang_keluar`
WHERE `no_faktur` LIKE 'BK20241223%' ESCAPE '!'
ORDER BY `no_faktur` DESC
---
    public function generateNoFaktur()
    {
        $builder = $this->db->table($this->table);
        $date = date('Ymd');
        $query = $builder->like('no_faktur', 'BK' . $date, 'after')
            ->orderBy('no_faktur', 'DESC')
            ->get()
            ->getRow();

SELECT `barang_keluar`.*, `pelanggan`.`nama_pelanggan`
FROM `barang_keluar`
JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `barang_keluar`.`id_pelanggan`
WHERE `barang_keluar`.`id_barang_keluar` = '7'
SELECT `barang_keluar`.*, `pelanggan`.`nama_pelanggan`
FROM `barang_keluar`
JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `barang_keluar`.`id_pelanggan`
ORDER BY `barang_keluar`.`tanggal` DESC
---
    public function getBarangKeluar($id = null)
    {
        $builder = $this->db->table('barang_keluar');
        $builder->select('barang_keluar.*, pelanggan.nama_pelanggan');
        $builder->join('pelanggan', 'pelanggan.id_pelanggan = barang_keluar.id_pelanggan');

        if ($id !== null) {
            $builder->where('barang_keluar.id_barang_keluar', $id);
            return $builder->get()->getRow();
        }

        $builder->orderBy('barang_keluar.tanggal', 'DESC');
        return $builder->get()->getResultArray();