app/Models/ModelLayanan.php

SELECT *
FROM `layanan`
---
    public function getLayanan($id = null)
    {
        if ($id === null) {
            return $this->findAll();