app/Models/ModelProduk.php

SELECT *
FROM `produk`
---
    public function getProduk()
    {
      $builder = $this->db->table('produk');
      return $builder->get();