app/Models/ModelUser.php

    public function getUser()
    {
      $builder = $this->db->table('user');
      return $builder->get();
---
SELECT *
FROM `user`