app/Models/ModelPelanggan.php

SELECT *
FROM `pelanggan`
---
    public function getPelanggan()
    {
      $builder = $this->db->table('pelanggan');
      return $builder->get();