app/Models/UserModel.php

    public function cek_login($username){
        return $this->db->table('user')->where(array('username'=>$username))->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'jane'